Revit 2027 API
ElementTypeDuplicatedEventArgs.OriginalElementTypeId Property
 The id of the element type that is duplicated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OriginalElementTypeId { get; }
Public ReadOnly Property OriginalElementTypeId As ElementId
	Get
public:
property ElementId^ OriginalElementTypeId {
	ElementId^ get ();
}
member OriginalElementTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace